In [1]:
## ----- Lab SQL Queries 9 ----- ##

In [2]:
# Create a Python connection with SQL database

In [3]:
!pip install sqlalchemy
!pip install PyMySQL

Requirement already satisfied: sqlalchemy in /Users/mariasoriano/opt/anaconda3/lib/python3.8/site-packages (1.3.20)
Requirement already satisfied: PyMySQL in /Users/mariasoriano/opt/anaconda3/lib/python3.8/site-packages (1.0.2)

In [4]:
import pymysql
from sqlalchemy import create_engine
import pandas as pd
import getpass
password = getpass.getpass()

········

In [8]:
connection_string = 'mysql+pymysql://root:' + password + '@localhost/sakila'
engine = create_engine(connection_string)

In [9]:
# 1. How many distinct (different) actors' last names are there?
# There are 121 different actors' last names

data = pd.read_sql_query('select count(distinct last_name) from sakila.actor', engine)
data

   count(distinct last_name)
0                        121

In [18]:
# 2. Add an additional column day_type with values 'weekend' and 'workday' depending on the rental day of the week.
query = '''select *,
case
when dayofweek(rental_date) between "1" and "5" then 'workday'
when dayofweek(rental_date) between "6" and "7" then 'weekend'
#else 'weekend'
end as day_type
from rental;'''
rental_date = pd.read_sql_query(query, engine)
rental_date.head()

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update,day_type
0,1,2005-05-24 22:53:30,367,130,2005-05-26 22:04:30,1,2006-02-15 21:30:53,workday
1,2,2005-05-24 22:54:33,1525,459,2005-05-28 19:40:33,1,2006-02-15 21:30:53,workday
2,3,2005-05-24 23:03:39,1711,408,2005-06-01 22:12:39,1,2006-02-15 21:30:53,workday
3,4,2005-05-24 23:04:41,2452,333,2005-06-03 01:43:41,2,2006-02-15 21:30:53,workday
4,5,2005-05-24 23:05:21,2079,222,2005-06-02 04:33:21,1,2006-02-15 21:30:53,workday

In [56]:
# 3. Get all films with ARMAGEDDON in the title.
query = '''select title as 'Films' from sakila.film where (lower(title) like '%ARMAGEDDON%');'''
armageddon = pd.read_sql_query(query, engine)
armageddon.head()

                   Films
0        ARMAGEDDON LOST
1    LADYBUGS ARMAGEDDON
2       METAL ARMAGEDDON
3    MOSQUITO ARMAGEDDON
4  STAGECOACH ARMAGEDDON

In [59]:
# 4. Get 10 the longest films.
query= '''select title, length from sakila.film
order by length DESC
limit 10;'''
longest_films = pd.read_sql_query(query, engine)
longest_films.head()

            title  length
0  DARN FORRESTER     185
1    POND SEATTLE     185
2   CHICAGO NORTH     185
3   MUSCLE BRIGHT     185
4    WORST BANGER     185

In [64]:
# 5.How many films include Behind the Scenes content?
# 538 films included Behind the Scenes content
query = '''select count(film_id) from sakila.film
where special_features like '%Behind the Scenes%';'''
behind = pd.read_sql_query(query, engine)
behind.head()

   count(film_id)
0             538

In [63]:
# 6. Which kind of movies (rating) have a mean duration of more than two hours?
# G, PG, NC-17, R and PG-13 movies have a mean duration of +2h hours
query='''select rating as 'Rating',
round(avg(length)) as 'Length Avg'  
from sakila.film
where length > 120
group by rating;'''
movie_rating = pd.read_sql_query(query, engine)
movie_rating.head()

  Rating  Length Avg
0      G       155.0
1     PG       151.0
2  NC-17       152.0
3      R       155.0
4  PG-13       154.0

In [65]:
# 7. Rank films by length (filter out the rows that have nulls or 0s in length column). In your output, only select the columns title, length, and the rank.
query='''select title, length, dense_rank() over(order by length) as 'rank'
from sakila.film
where length <> 0 and length <> ' '
order by length ASC;'''
rank_length=pd.read_sql_query(query, engine)
rank_length.head()

                 title  length  rank
0         ALIEN CENTER      46     1
1            IRON MOON      46     1
2        KWAI HOMEWARD      46     1
3     LABYRINTH LEAGUE      46     1
4  RIDGEMONT SUBMARINE      46     1